app/controllers/articles_controller.rb

  def show
    #'params[:id]' tem que ter sido mencionado em 'routes.rb', em: get"/articles/:id", to: "articles#show"
    #A Action 'show' chama 'Article.find' com o 'id' capturado pelo parâmetro de rota. O 'article' retonado é armazenado na variável de instância '@article', portanto, é acessível pela visualização. Por padrão, a action 'show renderizará 'app/views/articles/show.html.erb'.
    @article = Article.find(params[:id])
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]

  def create
    #@article = Article.new(title: "...", body: "...")
    @article = Article.new(article_params)

    if @article.save
---
INSERT INTO "articles" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Acho que estou aprendendo, Rails!"], ["body", "Continuarei nos estudos."], ["created_at", "2023-05-19 12:56:09.696762"], ["updated_at", "2023-05-19 12:56:09.696762"]]

  def destroy
    @article = Article.find(params[:id]) #A 'action' 'destroy' busca um 'article' no banco de dados e chama o 'destroy' nele.
    @article.destroy #Em seguida, ele redireciona o navegador para o caminho raiz com o código de status 303 See Other.
    redirect_to root_path, status: :see_other #Optamos por redirecionar para o caminho raiz porque esse é o nosso principal ponto de acesso para 'articles'. Mas, em outras circunstâncias, você pode optar por redirecionar para, por exemplo, 'articles_path'.
  end
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 2]]